<?php
$array['head']['lng'] = 'ru';
$array['head']['title'] = 'Паньчанга - 5anga.info';
$array['head']['headname'] = 'Паньчанга';
$array['head']['descr'] = 'Паньчанга для всего мира. Индийские праздники.';

$array['txt']['note'] = "Паньчанга зависит от координат. Выберите город или координаты места";
$array['txt']['calcul'] = "Вычисление...";
$array['txt']['help'] = "./inc/ruindex.html";
$array['txt']['helpcity'] = "Укажите название ближайшего города";
$array['txt']['helpcoo'] = "Укажите координаты и часовой пояс";
$array['txt']['city'] = "Город:";
$array['txt']['long'] = "Долгота:";
$array['txt']['lat'] = "Широта:";
$array['txt']['longwe'] = array("Западная", "Восточная");
$array['txt']['latns'] = array("Южная", "Северная");
$array['txt']['height'] = "Высота над уровнем моря:";
$array['txt']['height2'] = " метров";
$array['txt']['tz'] = "Часовой пояс:";
$array['txt']['calc'] = "Расчет";
$array['txt']['north_s'] = "С.Ш. ";
$array['txt']['south_s'] = "Ю.Ш. ";
$array['txt']['east_s'] = "В.Д. ";
$array['txt']['west_s'] = "З.Д. ";
$array['txt']['year'] = "Год:";
$array['txt']['month'] = "Месяц:";
$array['txt']['chmo'] = "Выберите месяц";
$array['txt']['monarr'] = array("январь", "февраль", "март", "апрель", "май", "июнь", "июль", "август", "сентябрь", "октябрь", "ноябрь", "декабрь");
$array['txt']['week'] = array("","Пн","Вт","Ср","Чт","Пт","Сб","Вс");

$array['p']['sm'] = array("Мэша", "Вришабха", "Митхуна", "Каркатака", "Симха", "Канья", "Тхула", "Вришчика", "Дханус", "Макара", "Кумбха", "Мина");
$array['p']['chm'] = array("", "Чаитра", "Ваишакха", "Джешта", "Ашадха", "Шравана", "Бхадрапада", "Ашваюджа", "Картика", "Мргашира", "Пушйа", "Магха", "Пхалгуна");
$array['p']['paksha'] = array("Кришна пакша ", "Шукла пакша ");
$array['p']['tithi'] = array("Амавасья","Пратипат","Двитья","Тритья","Чатуртхи","Панчами","Шашти","Саптами","Аштами","Навами","Дашами","Экадаши","Двадаши","Трайодаши","Чатурдаши","Пурнима");
$array['p']['naksh'] = array("","Ашвини","Бхарани","Криттика","Рохини","Мригашира","Ардра","Пунарвасу","Пушья","Ашлеша","Магха","Пурва-Пхалгуни","Уттара-Пхалгуни","Хаста","Читра","Свати","Вишакха","Анурадха","Джйештха","Мула","Пурва-Ашадха","Уттара-Ашадха","Шравана","Дхаништха","Шатабхиша","Пурва-Бхадра","Уттара-Бхадра","Ревати");
$array['p']['ecl'] = array("","Кольцевое затмение","Кольцевое затмение со смещенным центром","Полное затмение","Кольцеобразно-полное затмение","Частичное затмение","Полутеневое затмение");
$array['p']['ecl_par'] = "Частичное затмение:";
$array['p']['ecl_penu'] = "Полутеневое затмение:";
$array['p']['ecl_tot'] = "Полное затмение:";
$array['p']['ecl_max'] = "Максимум затмения в:";
$array['p']['ecl_sar'] = "сарос: ";
$array['p']['ecl_coo'] = "Координаты максимума:";
$array['p']['ecl_obs'] = "Затмение можно наблюдать в выбранных координатах.";
$array['p']['ecl_noobs'] = "В выбранных координатах затмение не наблюдается.";

$array['txtp']['sm'] = 'Солнечный месяц:';
$array['txtp']['mm'] = 'Лунный месяц:';
$array['txtp']['mml'] = 'адхика';
$array['txtp']['full'] = 'Весь день';
$array['txtp']['t'] = 'Титхи:';
$array['txtp']['na'] = 'Накшатра:';
$array['txtp']['sr'] = 'Восход солнца:';
$array['txtp']['ss'] = 'Заход солнца:';
$array['txtp']['mr'] = 'Восход луны:';
$array['txtp']['ms'] = 'Заход луны:';
$array['txtp']['time'] = 'H:mm:ss';
$array['txtp']['from'] = '[с :] H:mm:ss';
$array['txtp']['beg'] = 'начало: ';
$array['txtp']['till'] = '[до:] H:mm:ss';
$array['txtp']['after'] = '[после:] H:mm:ss';
$array['txtp']['end'] = 'окончание: ';
$array['txtp']['date'] = 'D MMMM YYYY';
$array['txtp']['data'] = 'D.M.YYYY H:mm:ss';

$array['holy']['ek'] = array(1=>"Унмилини Махадвадаши", 2=>"Вьянджули Махадвадаши", 3=>"Триспарша Махадвадаши", 4=>"Пакшавардини Махадвадаши", 5=>"Джайа Махадвадаши", 6=>"Джайанти Махадвадаши", 7=>"Папа Нашини Махадвадаши", 8=>"Виджайа Махадвадаши", 9=>"", 10=>"", 11=>"", 12=>"", 13=>"");

//$array['txt']['error_input_year'] = 'Укажите год в диапазоне с 1800 до 2399';
//$array['txt']['error_input_month'] = 'Укажите месяц в диапазоне от 1 до 12';
$array['error']['input_lat'] = 'Укажите широту в градусах от -90 до 90';
$array['error']['input_long'] = 'Укажите долготу в градусах от -179 до 180';
//$array['txt']['error_lat_m'] = 'Укажите минуты широты от 0 до 59';
//$array['txt']['error_long_m'] = 'Укажите минуты долготы от 0 до 59';
//$array['txt']['error_height1'] = 'Высота над уровнем моря не должна быть меньше 0м';
//$array['txt']['error_height2'] = 'Высота над уровнем моря должна быть меньше 9000м';
//$array['txt']['error_polar'] = 'За полярным кругом может не быть восходов/заходов солнца, без них расчеты могут быть неточными';
$array['error']['tz'] = 'Укажите часовой пояс';
$array['error']['dial'] = 'Недостаточно данных';
$array['error']['arc'] = 'В полярные день или ночь расчет событий по паньчанге невозможен';

//print_r($array);
//echo json_encode($array, JSON_FORCE_OBJECT);
?>